nc: 1
scale: n
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 2, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C2f, [256, True]]

head:
  - [-1, 1, Conv, [256, 3, 1]]
  - [[-1], 1, Detect, [nc]]
